

https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf


https://pandas.pydata.org/pandas-docs/stable/getting_started/comparison/comparison_with_sql.html

- read files
- explore data
- do analysis
- export data

https://developers.arcgis.com/python/api-reference/arcgis.features.toc.html#geoaccessor

In [35]:
import pandas

Pandas can handle a lot of different data.  Two easy ways you might want to create a dataframe for your own purposes are from a list of lists (or tuples) or from a list of dictionaries.  Both of these methods can be super helpful for summarizing data or logging your results.

In [36]:
data_1 =[
    [1, 'one'],
    [2, 'two'],
    [3, 'three'],
    [4, 'four']    
]

df_1 = pandas.DataFrame(data_1)
df_1.columns=['OID', 'text field']
df_1

   OID text field
0    1        one
1    2        two
2    3      three
3    4       four

In [26]:
data_2 = [
    {"OID": 1, "new text": "five", "Date": '4/18/2020'},
    {"OID": 2, "new text": "six", "Date": '4/19/2020'},
    {"OID": 4, "new text": "ten", "Date": '4/20/2020'}
]

df_2 = pandas.DataFrame(data_2)
df_2

   OID new text       Date
0    1     five  4/18/2020
1    2      six  4/19/2020
2    4      ten  4/20/2020

In [25]:
df_2.dtypes

OID          int64
new text    object
Date        object
dtype: object

## Working with columns/fields

In [27]:
# return just one field
df_2['new text']

0    five
1     six
2     ten
Name: new text, dtype: object

In [28]:
# turn one field into a list
df_2['new text'].tolist()

['five', 'six', 'ten']

In [29]:
# return multiple fields
df_2[['OID','Date']]

   OID       Date
0    1  4/18/2020
1    2  4/19/2020
2    4  4/20/2020

## Adding new columns/fields

In [30]:
df_1['added field'] = [10, 11, 12, 13]
df_1

   OID text field  added field
0    1        one           10
1    2        two           11
2    3      three           12
3    4       four           13

In [32]:
df_1['added field 2'] = df_1['added field'] * 2
df_1

   OID text field  added field  added field 2
0    1        one           10             20
1    2        two           11             22
2    3      three           12             24
3    4       four           13             26

## Selecting a subset of records

Selecting individual records from a DataFrame is a lot like adding a new invisible column with a true/false value.

In [33]:
# quick true/false test

df_1['OID'] > 2

0    False
1    False
2     True
3     True
Name: OID, dtype: bool

In [34]:
# now return all the records in the DataFrame that meet that condition

df_1[df_1['OID'] > 2]

   OID text field  added field  added field 2
2    3      three           12             24
3    4       four           13             26

In [20]:
pandas.merge(df_1, df_2, 'left', 'OID')

   OID text field new text
0    1        one     five
1    2        two      six
2    3      three      NaN
3    4       four      ten